## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 22 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                        |
|----------|-----------------------------------------------------------------------------------|
| add      | `module.cbs_logs_bucket[0].aws_s3_bucket.this`                                    |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_acl.this`                                |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_ownership_controls.this`                 |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_policy.this`                             |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_public_access_block.this`                |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_versioning.this`                         |
| update   | `aws_athena_named_query.create_table_alb_logs`                                    |
|          | `aws_athena_named_query.create_table_all_waf_logs`                                |
|          | `aws_athena_named_query.create_table_waf_logs`                                    |
|          | `aws_athena_named_query.create_table_waf_logs_api_lambda`                         |
|          | `aws_cloudwatch_dashboard.emails[0]`                                              |
|          | `aws_cloudwatch_dashboard.sms[0]`                                                 |
|          | `aws_cloudwatch_log_group.route53_resolver_query_log[0]`                          |
|          | `aws_cloudwatch_log_group.sns_deliveries[0]`                                      |
|          | `aws_cloudwatch_log_group.sns_deliveries_failures[0]`                             |
|          | `aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]`                   |
|          | `aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]`                            |
|          | `aws_cloudwatch_log_metric_filter.sns-sms-blocked-as-spam[0]`                     |
|          | `aws_cloudwatch_log_metric_filter.sns-sms-blocked-as-spam-us-west-2[0]`           |
|          | `aws_cloudwatch_log_metric_filter.sns-sms-phone-carrier-unavailable[0]`           |
|          | `aws_cloudwatch_log_metric_filter.sns-sms-phone-carrier-unavailable-us-west-2[0]` |
|          | `aws_cloudwatch_log_metric_filter.sns-sms-rate-exceeded[0]`                       |
|          | `aws_cloudwatch_log_metric_filter.sns-sms-rate-exceeded-us-west-2[0]`             |
|          | `aws_route53_resolver_query_log_config.dns_query_log_config[0]`                   |
|          | `aws_s3_bucket_policy.alb_log_bucket_allow_elb_account`                           |
|          | `aws_s3_bucket_policy.sns_sms_usage_report_bucket_policy`                         |
|          | `aws_s3_bucket_policy.sns_sms_usage_report_bucket_us_west_2_policy`               |
|          | `aws_sns_topic.notification-canada-ca-alert-general`                              |
| recreate | `module.notify_slack_critical.module.lambda.null_resource.archive[0]`             |
|          | `module.notify_slack_general.module.lambda.null_resource.archive[0]`              |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`                   |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_athena_named_query.create_table_alb_logs will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_alb_logs" {
        id          = "d68a28f2-6b1d-4d64-a55e-57b0b3365501"
        name        = "create_table_alb_logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_named_query.create_table_all_waf_logs will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_all_waf_logs" {
        id          = "a9303f07-6939-49a9-a154-938e24f9e7fb"
        name        = "WAF: create table waf_logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_named_query.create_table_waf_logs will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_waf_logs" {
        id          = "6c04e571-2d74-45e3-b542-57e94baac3df"
        name        = "WAF: create table waf_logs_lb"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_named_query.create_table_waf_logs_api_lambda will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_waf_logs_api_lambda" {
        id          = "bc24bd8f-8290-4214-95f3-d00c0418d7db"
        name        = "WAF: create table waf_logs_api_lambda"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.emails[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "emails" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ dashboard_body = (sensitive value)
        id             = "Emails"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.sms[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "sms" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ dashboard_body = (sensitive value)
        id             = "SMS"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.route53_resolver_query_log[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "route53_resolver_query_log" {
        id                = "route53/ca-central-1/239043911459/DNS/logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sns_deliveries[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sns_deliveries" {
        id                = "sns/ca-central-1/239043911459/DirectPublishToPhoneNumber"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sns_deliveries_failures[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sns_deliveries_failures" {
        id                = "sns/ca-central-1/239043911459/DirectPublishToPhoneNumber/Failure"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sns_deliveries_failures_us_west_2" {
        id                = "sns/us-west-2/239043911459/DirectPublishToPhoneNumber/Failure"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sns_deliveries_us_west_2[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sns_deliveries_us_west_2" {
        id                = "sns/us-west-2/239043911459/DirectPublishToPhoneNumber"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_metric_filter.sns-sms-blocked-as-spam[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "sns-sms-blocked-as-spam" {
        id             = "sns-sms-blocked-as-spam"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ log_group_name = (sensitive value)
        name           = "sns-sms-blocked-as-spam"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.sns-sms-blocked-as-spam-us-west-2[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "sns-sms-blocked-as-spam-us-west-2" {
        id             = "sns-sms-blocked-as-spam-us-west-2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ log_group_name = (sensitive value)
        name           = "sns-sms-blocked-as-spam-us-west-2"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.sns-sms-phone-carrier-unavailable[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "sns-sms-phone-carrier-unavailable" {
        id             = "sns-sms-phone-carrier-unavailable"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ log_group_name = (sensitive value)
        name           = "sns-sms-phone-carrier-unavailable"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.sns-sms-phone-carrier-unavailable-us-west-2[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "sns-sms-phone-carrier-unavailable-us-west-2" {
        id             = "sns-sms-phone-carrier-unavailable-us-west-2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ log_group_name = (sensitive value)
        name           = "sns-sms-phone-carrier-unavailable-us-west-2"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.sns-sms-rate-exceeded[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "sns-sms-rate-exceeded" {
        id             = "sns-sms-rate-exceeded"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ log_group_name = (sensitive value)
        name           = "sns-sms-rate-exceeded"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.sns-sms-rate-exceeded-us-west-2[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "sns-sms-rate-exceeded-us-west-2" {
        id             = "sns-sms-rate-exceeded-us-west-2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ log_group_name = (sensitive value)
        name           = "sns-sms-rate-exceeded-us-west-2"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_resolver_query_log_config.dns_query_log_config[0] will be updated in-place
  ~ resource "aws_route53_resolver_query_log_config" "dns_query_log_config" {
        id              = "rqlc-f83a5950234b4aa2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name            = (sensitive value)
        tags            = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.alb_log_bucket_allow_elb_account will be updated in-place
  ~ resource "aws_s3_bucket_policy" "alb_log_bucket_allow_elb_account" {
        id     = "notification-canada-ca-staging-alb-logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.sns_sms_usage_report_bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "sns_sms_usage_report_bucket_policy" {
        id     = "notification-canada-ca-staging-sms-usage-logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.sns_sms_usage_report_bucket_us_west_2_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "sns_sms_usage_report_bucket_us_west_2_policy" {
        id     = "notification-canada-ca-staging-sms-usage-west-2-logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_sns_topic.notification-canada-ca-alert-general will be updated in-place
  ~ resource "aws_sns_topic" "notification-canada-ca-alert-general" {
        id                                       = "arn:aws:sns:ca-central-1:239043911459:alert-general"
        name                                     = "alert-general"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy                                   = (sensitive value)
        tags                                     = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (28 unchanged attributes hidden)
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSELBLogDeliveryWrite"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::985666609251:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cbs-satellite-239043911459"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "CostCentre" = "notification-canada-ca-staging"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "CostCentre" = "notification-canada-ca-staging"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 90
            }
        }

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4343283993432098235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1727280227128767000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8065581048293872297" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1727280218566929200"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5799159728241661225" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1727280227160256000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3493195851672287646" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1727280227115166000"
            # (1 unchanged element hidden)
        }
    }

Plan: 10 to add, 22 to change, 4 to destroy.

Changes to Outputs:
  ~ cbs_satellite_bucket_name                           = "" -> "cbs-satellite-239043911459"

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 67 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json...
```

</details>
